function foo() {
  var a = 1;

  function bar() {
    console.log(a);
  }

  return bar;
}

var baz = foo();

baz(); // 1 -- Ого, замыкание только что было раскрыто, мужики!

// =============================================================================

function foo2() {
  var a = 2;

  function baz2() {
    console.log(a); // 2
  }

  bar2(baz2);
}

function bar2(fn) {
  fn(); // смотри мам, я видел замыкание!
}

foo2();

// =============================================================================

var fn3;

function foo3() {
  var a = 3;

  function baz3() {
    console.log(a);
  }

  fn3 = baz3; // присваиваем `baz` глобальной переменной
}

function bar3() {
  fn3(); // смотри мам, я видел замыкание!
}

foo3();

bar3(); // 3

// =============================================================================
